[
  {
    "strMeal": "Chicken Handi",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
    "id": "52795",
    "price": 460,
    "category_id": "4",
    "strIngredient1": "Chicken",
    "strIngredient2": "Onion",
    "strIngredient3": "Tomatoes",
    "strIngredient4": "Garlic",
    "strIngredient5": "Ginger paste",
    "strIngredient6": "Vegetable oil",
    "strInstructions": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!"
  },
  {
    "strMeal": "Dal fry",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
    "id": "52785",
    "price": 260,
    "category_id": "1",
    "strIngredient1": "Toor dal",
    "strIngredient2": "Water",
    "strIngredient3": "Salt",
    "strIngredient4": "Turmeric",
    "strIngredient5": "Ghee",
    "strIngredient6": "Chopped tomatoes",
    "strInstructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan."
  },
  {
    "strMeal": "Kidney Bean Curry",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg",
    "id": "52868",
    "price": 390,
    "category_id": "2",
    "strIngredient1": "Vegetable Oil",
    "strIngredient2": "Onion",
    "strIngredient3": "Garlic",
    "strIngredient4": "Ginger",
    "strIngredient5": "Coriander",
    "strIngredient6": "Cumin",
    "strInstructions": "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.\r\n\r\nAdd the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.\r\n\r\nTurn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves."
  },
  {
    "strMeal": "Lamb Biryani",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
    "id": "52805",
    "price": 660,
    "category_id": "3",
    "strIngredient1": "Vegetable Oil",
    "strIngredient2": "Onion",
    "strIngredient3": "Garlic",
    "strIngredient4": "Ginger",
    "strIngredient5": "Coriander",
    "strIngredient6": "Cumin",
    "strInstructions": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles."
  },

  {
    "strMeal": "Matar Paneer",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg",
    "price": 360,
    "id": "52865",
    
    "category_id": "1",
    "strIngredient1": "Sunflower Oil",
    "strIngredient2": "Paneer",
    "strIngredient3": "Ginger",
    "strIngredient4": "Cumin",
    "strIngredient5": "Turmeric",
    "strIngredient6": "Coriander",
    "strInstructions": "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.\r\nPut the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice."
  },
  {
    "strMeal": "Nutty Chicken Curry",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg",
    "id": "52851",
    "price": 460,
    "category_id": "1",
    "strIngredient1": "Red Chilli",
    "strIngredient2": "Ginger",
    "strIngredient3": "Garlic",
    "strIngredient4": "Coriander",
    "strIngredient5": "Sunflower Oil",
    "strIngredient6": "Chicken Breasts",
    "strInstructions": "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato."
  },
  {
    "strMeal": "Recheado Masala Fish",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
    "id": "52809",
    "price": 380,
    "category_id": "2",
    "strIngredient1": "Mackerel",
    "strIngredient2": "Red Chili",
    "strIngredient3": "Ginger",
    "strIngredient4": "Garlic",
    "strIngredient5": "Pepper",
    "strIngredient6": "Cumin",
    "strInstructions": "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar.\r\nAdd sugar and salt.\r\nAlso add turmeric powder.\r\nCombine all nicely and marinate for 35-40 mins.\r\nGrind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish.\r\nRinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity.\r\nNow stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins.\r\nPlace oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels.\r\nFry until golden brown from both sides\r\nServe the recheado mackerels hot with salad, lime wedges, rice and curry."
  },
  {
    "strMeal": "Smoked Haddock Kedgeree",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
    "id": "52964",
    "category_id": "3",
    "price": 460,
    "strIngredient1": "Butter",
    "strIngredient2": "Onion",
    "strIngredient3": "Cardamom",
    "strIngredient4": "Turmeric",
    "strIngredient5": "Cinnamon Stick",
    "strIngredient6": "Bay Leaf",
    "strInstructions": "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.\r\n\r\nStir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.\r\n\r\nTip in 450g basmati rice and stir until it is all well coated in the spicy butter.\r\n\r\nPour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.\r\n\r\nMeanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.\r\n\r\nHard-boil 3 eggs for 8 minutes.\r\n\r\nFlake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop. \r\n\r\nUncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.\r\n\r\nGently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges."
  },
  {
    "strMeal": "Tandoori chicken",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg",
    "id": "52806",
    "price": 460,
    "category_id": "2",
    "strIngredient1": "lemons",
    "strIngredient2": "paprika",
    "strIngredient3": "red onions",
    "strIngredient4": "chicken thighs",
    "strIngredient5": "vegetable oil",
    "strIngredient6": "Greek yogurt",
    "strInstructions": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through."
  },
  {
    "strMeal": "Baingan Bharta",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg",
    "id": "52807",
    "category_id": "2",
    "price": 160,
    "strIngredient1": "Aubergine",
    "strIngredient2": "Onion",
    "strIngredient3": "Tomatoes",
    "strIngredient4": "Garlic",
    "strIngredient5": "Green Chili",
    "strIngredient6": "Red Chili Powder",
    "strInstructions": "Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r\nkeep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r\nthe smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r\ncooked. You could also embed some garlic cloves in the baingan and then roast it.\r\n2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r\neasily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r\ndown.\r\n3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r\nUse natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r\n4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r\naubergine is kept."
  },
  {
    "strMeal": "Lamb Rogan josh",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg",
    "id": "52808",
    "price": 760,
    "category_id": "4",
    "strIngredient1": "Aubergine",
    "strIngredient2": "Onion",
    "strIngredient3": "Tomatoes",
    "strIngredient4": "Garlic",
    "strIngredient5": "Green Chili",
    "strIngredient6": "Red Chili Powder",
    "strInstructions": "\r\nPut the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.\r\nTip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.\r\nCover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice."
  },
    {
      "id": "52771",
      "price": 360,
      "strMeal": "Spicy Arrabiata Penne",
      "strDrinkAlternate": null,
      "category_id": "2",
      "strCategory": "Vegetarian",
      "strArea": "Indian",
      "strIngredient1": "penne rigate",
      "strIngredient2": "olive oil",
      "strIngredient3": "garlic",
      "strIngredient4": "chopped tomatoes",
      "strIngredient5": "red chile flakes",
      "strIngredient6": "italian seasoning",
      "strInstructions": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.\r\nIn a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.\r\nDrain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm.",
      "strMealThumb": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg"
    }

]
